samdonnelly/STM32F4-driver-library/stm32f4/headers/devices/fatfs_driver.h
/**
 * @file fatfs_driver.h
 * 
 * @author Sam Donnelly (samueldonnelly11@gmail.com)
 * 
 * @brief FATFS driver interface 
 * 
 * @version 0.1
 * @date 2022-05-18
 * 
 * @copyright Copyright (c) 2022
 * 
 */

#ifndef _FATFS_DRIVER_H_
#define _FATFS_DRIVER_H_

#ifdef __cplusplus
extern "C" {
#endif

//=======================================================================================
// Includes

#include "stm32f411xe.h"
#include "tools.h"

//=======================================================================================


//=======================================================================================
// Macros 

// f_mount opt argument 
#define FATFS_MOUNT_LATER 0         // To be mounted on the first access to the volume 
#define FATFS_MOUNT_NOW 1           // Force mount to check if it's ready to work 

// f_open mode flags (some are FatFs mode flags) 
#define FATFS_MODE_R        (FA_READ)                                  // 0x01 - "r" 
#define FATFS_MODE_RR       (FA_READ | FA_WRITE)                       // 0x03 - "r+" 
#define FATFS_MODE_W        (FA_CREATE_ALWAYS | FA_WRITE)              // 0x0A - "w" 
#define FATFS_MODE_WW       (FA_CREATE_ALWAYS | FA_WRITE | FA_READ)    // 0x0B - "w+" 
#define FATFS_MODE_A        (FA_OPEN_APPEND | FA_WRITE)                // 0x32 - "a" 
#define FATFS_MODE_AA       (FA_OPEN_APPEND | FA_WRITE | FA_READ)      // 0x33 - "a+" 
#define FATFS_MODE_WX       (FA_CREATE_NEW | FA_WRITE)                 // 0x06 - "wx" 
#define FATFS_MODE_WWX      (FA_CREATE_NEW | FA_WRITE | FA_READ)       // 0x07 - "w+x" 
#define FATFS_MODE_OAW      (FA_OPEN_ALWAYS | FA_WRITE)                // 0x12 
#define FATFS_MODE_OAWR     (FA_OPEN_ALWAYS | FA_WRITE | FA_READ)      // 0x13 
#define FATFS_MODE_OEW      (FA_OPEN_EXISTING | FA_WRITE)              // 0x02 
#define FATFS_MODE_OEWR     (FA_OPEN_EXISTING | FA_WRITE | FA_READ)    // 0x03 

// Functions 
#define f_unmount(path) f_mount(NULL, path, FATFS_MOUNT_NOW)     // Unmount card 

//=======================================================================================


//=======================================================================================
// Enums 

/**
 * @brief FATFS card types 
 * 
 * @details Identifiers for the card type. The card type is used internally for determining 
 *          how to handle a particular drive when read and write operations are called 
 *          by the FATFS module layer. The card type is determined during the drive 
 *          initialization process. 
 * 
 * @see fatfs_init 
 */
typedef enum {
    FATFS_CT_UNKNOWN     = 0x00,   // Unknown card type - failed to read 
    FATFS_CT_MMC         = 0x01,   // MMC version 3
    FATFS_CT_SDC1        = 0x02,   // SDC version 1
    FATFS_CT_SDC2_BYTE   = 0x04,   // SDC version 2 - byte address 
    FATFS_CT_SDC2_BLOCK  = 0x0C    // SDC version 2 - block address 
} fatfs_card_type_t;


/**
 * @brief FATFS disk function results 
 * 
 * @details The result of the read and write operations. The return type of numerous functions 
 *          in the driver is DISK_RESULT which is a typedef of this enum. If the operation is 
 *          successful then FATFS_RES_OK will be returned. If not then the problem will be 
 *          reflected in the result. 
 */
typedef enum {
    FATFS_RES_OK,       // the function succeeded
    FATFS_RES_ERROR,    // an error occured 
    FATFS_RES_WRPRT,    // the medium is write protected 
    FATFS_RES_NOTRDY,   // device has not been initialized 
    FATFS_RES_PARERR    // command code or parameter is invalid 
} fatfs_disk_results_t;

//=======================================================================================


//=======================================================================================
// Data types 

typedef uint8_t DISK_STATUS;
typedef fatfs_disk_results_t DISK_RESULT; 
typedef fatfs_card_type_t CARD_TYPE; 

//=======================================================================================


//=======================================================================================
// User functions 

/**
 * @brief FATFS user init 
 * 
 * @details This functions is called directly by the user and used to set parameters for 
 *          the fatfs driver that define the characteristics of the drive. Characteristics 
 *          such as the disk status, card type, power flag and slave select pin are 
 *          initialized here but currently only the slave select pin is configurable 
 *          through a call to this function. 
 *          
 *          This function should be called during initialization in the application code. 
 * 
 * @param spi : SPI port used by the SD card 
 * @param gpio : GPIO port used for the SD card slave select pin 
 * @param fatfs_slave_pin : slave pin (GPIO pin) used to select the slave device 
 */
void fatfs_user_init(
    SPI_TypeDef *spi, 
    GPIO_TypeDef *gpio,  
    uint16_t fatfs_slave_pin);


/**
 * @brief FATFS get card type 
 * 
 * @details Getter for use by application code. 
 * 
 * @return CARD_TYPE : card type of volume 
 */
CARD_TYPE fatfs_get_card_type(void); 


/**
 * @brief FATFS ready to receive commands 
 * 
 * @details Waits for the SD card DO/MISO line to go high (0xFF) which indicates that the 
 *          card is ready to receive further instructions. The function is called before 
 *          sending a command and before writing new data packets to the card. 
 */
DISK_RESULT fatfs_ready_rec(void); 


/**
 * @brief FATFS get volume presence 
 * 
 * @details Checks that there is a volume present by checking if the volume is ready to 
 *          receive commands. If present the function will return FATFS_RES_OK and if not 
 *          then it will return FATFS_RES_ERROR. Returning FATFS_RES_ERROR means the 
 *          volume did not respond in enough time. This function is used by the FATFS 
 *          controller in the "not ready" state where reading/writing is not being 
 *          performed which means a timeout indicates the volume is not busy but rather 
 *          non-existant. 
 * 
 * @return DISK_RESULT : result of the volume check 
 */
DISK_RESULT fatfs_get_existance(void); 

//=======================================================================================


//=======================================================================================
// diskio functions 

// These functions should not be called by the application directly. They're used to 
// implement the functionality of the FATFS filesystem functions (ex. f_read). 

//=======================================================================================

#ifdef __cplusplus
}
#endif

#endif  // _FATFS_DRIVER_H_
